# Chapter 14. Odds ’n’ Ends

In [1]:
%load_ext lab_black
%load_ext sql
%sql postgresql://sql-cookbook:sql-cookbook@0.0.0.0:5432/sql-cookbook

## 14.1 Creating Cross-Tab Reports Using SQL Server’s PIVOT Operator

In [2]:
%%sql
create extension if not exists tablefunc;

select dept_10, dept_20, dept_30, dept_40
from crosstab($$
    select 1 as row, deptno, count(empno) as count
    from dept natural left join emp
    group by deptno
    order by deptno;
$$) as ct(row int,
          dept_10 bigint,
          dept_20 bigint,
          dept_30 bigint,
          dept_40 bigint);

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
Done.
1 rows affected.

[(3, 5, 6, 0)]

## 14.2 Unpivoting a Cross-Tab Report Using SQL Server’s UNPIVOT Operator

In [3]:
%%sql
with data as (
    select *
    from (values (3, 5, 6, 0))
             as t(accounting, research, sales, operations)
)
select unnest(array ['accounting', 'research', 'sales', 'operations']) as dname,
       unnest(array [accounting, research, sales, operations])         as count
from data;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
4 rows affected.

[('accounting', 3), ('research', 5), ('sales', 6), ('operations', 0)]

## 14.3 Transposing a Result Set Using Oracle’s MODEL Clause

In [4]:
%%sql
create extension if not exists tablefunc;

select d10, d20, d30
from crosstab($$
    select 1 as row, deptno, count(*) as count
    from emp
    group by deptno
    order by deptno;
$$) as ct(row int, d10 bigint, d20 bigint, d30 bigint);

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
Done.
1 rows affected.

[(3, 5, 6)]

## 14.4 Extracting Elements of a String from Unfixed Locations

In [5]:
%%sql
with logs as (
    select unnest(array [
        'xxxxxabc[867]xxx[-]xxxx[5309]xxxxx',
        'xxxxxtime:[11271978]favnum:[4]id:[Joe]xxxxx',
        'call:[F_GET_ROWS()]b1:[ROSEWOOD…SIR]b2:[44400002]77.90xxxxx',
        'film:[non_marked]qq:[unit]tailpipe:[withabanana?]80sxxxxx'
        ]) as text),
     matches as (
         select regexp_matches(text, '\[(.+?)].*\[(.+?)].*\[(.+?)]') as match
         from logs
     )
select match[1] as first_val,
       match[2] as second_val,
       match[3] as last_val
from matches;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
4 rows affected.

[('867', '-', '5309'),
 ('11271978', '4', 'Joe'),
 ('F_GET_ROWS()', 'ROSEWOOD…SIR', '44400002'),
 ('non_marked', 'unit', 'withabanana?')]

## 14.5 Finding the Number of Days in a Year (an Alternate Solution for Oracle)

In [6]:
%%sql
select to_char(date_trunc('year', now()) + '1 year - 1 day', 'ddd')::int as days;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(366,)]

## 14.6 Searching for Mixed Alphanumeric Strings

In [7]:
%%sql
with strings as (
    select unnest(array [
        '1010 switch',
        '333',
        '3453430278',
        'ClassSummary',
        'findRow 55',
        'threes'
        ]) as text
)
select text
from strings
where text ~ '(?i)^(?=.*\d)(?=.*[a-z])';

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
2 rows affected.

[('1010 switch',), ('findRow 55',)]

## 14.7 Converting Whole Numbers to Binary Using Oracle

In [8]:
%%sql
select ename, sal, sal::bit(16) as sal_binary
from emp;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
14 rows affected.

[('SMITH', 800, '0000001100100000'),
 ('ALLEN', 1600, '0000011001000000'),
 ('WARD', 1250, '0000010011100010'),
 ('JONES', 2975, '0000101110011111'),
 ('MARTIN', 1250, '0000010011100010'),
 ('BLAKE', 2850, '0000101100100010'),
 ('CLARK', 2450, '0000100110010010'),
 ('SCOTT', 3000, '0000101110111000'),
 ('KING', 5000, '0001001110001000'),
 ('TURNER', 1500, '0000010111011100'),
 ('ADAMS', 1100, '0000010001001100'),
 ('JAMES', 950, '0000001110110110'),
 ('FORD', 3000, '0000101110111000'),
 ('MILLER', 1300, '0000010100010100')]

## 14.8 Pivoting a Ranked Result Set

In [9]:
%%sql
create extension if not exists tablefunc;

select *
from crosstab( $$
    with emp as (
        select case
                   when dense_rank() over (order by sal desc) <= 3 then 'TOP_3'
                   when dense_rank() over (order by sal desc) between 3 and 6 then 'NEXT_3'
                   else 'REST'
                   end                         as category,
               format(e'%s\t(%s)', ename, sal) as ename
        from emp
        order by category, sal desc
    )
    select row_number() over (partition by category) as row, *
    from emp order by row;
$$, $$
    select unnest(array ['TOP_3', 'NEXT_3', 'REST'])
$$) as ct(row int, top_3 text, next_3 text, rest text);

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
Done.
7 rows affected.

[(1, 'KING\t(5000)', 'BLAKE\t(2850)', 'TURNER\t(1500)'),
 (2, 'SCOTT\t(3000)', 'CLARK\t(2450)', 'MILLER\t(1300)'),
 (3, 'FORD\t(3000)', 'ALLEN\t(1600)', 'WARD\t(1250)'),
 (4, 'JONES\t(2975)', None, 'MARTIN\t(1250)'),
 (5, None, None, 'ADAMS\t(1100)'),
 (6, None, None, 'JAMES\t(950)'),
 (7, None, None, 'SMITH\t(800)')]

## 14.9 Adding a Column Header into a Double Pivoted Result Set

In [10]:
%%sql
create extension if not exists tablefunc;

select research, apps
from crosstab( $$
    with it_research as (select *
                         from (values (100, 'HOPKINS'),
                                      (100, 'JONES'),
                                      (100, 'TONEY'),
                                      (200, 'MORALES'),
                                      (200, 'P.WHITAKER'),
                                      (200, 'MARCIANO'),
                                      (200, 'ROBINSON'),
                                      (300, 'LACY'),
                                      (300, 'WRIGHT'),
                                      (300, 'J.TAYLOR')
                              ) as t(deptno, ename)),
         it_apps as (select *
                     from (values (400, 'CORRALES'),
                                  (400, 'MAYWEATHER'),
                                  (400, 'CASTILLO'),
                                  (400, 'MARQUEZ'),
                                  (400, 'MOSLEY'),
                                  (500, 'GATTI'),
                                  (500, 'CALZAGHE'),
                                  (600, 'LAMOTTA'),
                                  (600, 'HAGLER'),
                                  (600, 'HEARNS'),
                                  (600, 'FRAZIER'),
                                  (700, 'GUINN'),
                                  (700, 'JUDAH'),
                                  (700, 'MARGARITO')
                          ) as t(deptno, ename)),
         it as (
             select distinct deptno, null as ename, 'RESEARCH' as category
             from it_research
             union
             select distinct deptno, null, 'APPS'
             from it_apps
             union
             select deptno, ename, 'RESEARCH'
             from it_research
             union
             select deptno, ename, 'APPS'
             from it_apps
         )
    select row_number() over (partition by category order by deptno, ename is not null) as row,
           category,
           case
               when ename is not null then format(e'%s - - -', ename)
               else deptno::text
               end                                                                      as cell
    from it
    order by row, category;
$$, $$
    select unnest(array ['RESEARCH', 'APPS'])
$$) as ct(row int, research text, apps text);

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
Done.
18 rows affected.

[('100', '400'),
 ('TONEY - - -', 'CASTILLO - - -'),
 ('HOPKINS - - -', 'MAYWEATHER - - -'),
 ('JONES - - -', 'MARQUEZ - - -'),
 ('200', 'CORRALES - - -'),
 ('P.WHITAKER - - -', 'MOSLEY - - -'),
 ('MARCIANO - - -', '500'),
 ('ROBINSON - - -', 'CALZAGHE - - -'),
 ('MORALES - - -', 'GATTI - - -'),
 ('300', '600'),
 ('LACY - - -', 'HAGLER - - -'),
 ('WRIGHT - - -', 'HEARNS - - -'),
 ('J.TAYLOR - - -', 'FRAZIER - - -'),
 (None, 'LAMOTTA - - -'),
 (None, '700'),
 (None, 'MARGARITO - - -'),
 (None, 'JUDAH - - -'),
 (None, 'GUINN - - -')]

## 14.10 Converting a Scalar Subquery to a Composite Subquery in Oracle

In [11]:
%%sql
with emp as (
    select deptno,
           ename,
           sal,
           (
               select json_build_object('dname', dname, 'loc', loc, 'today', now()::date)
               from dept
               where emp.deptno = dept.deptno
           ) as json
    from emp
)
select deptno,
       ename,
       sal,
       json ->> 'dname' as dname,
       json ->> 'loc'   as loc,
       json ->> 'today' as today
from emp;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
14 rows affected.

[(20, 'SMITH', 800, 'RESEARCH', 'DALLAS', '2020-12-21'),
 (30, 'ALLEN', 1600, 'SALES', 'CHICAGO', '2020-12-21'),
 (30, 'WARD', 1250, 'SALES', 'CHICAGO', '2020-12-21'),
 (20, 'JONES', 2975, 'RESEARCH', 'DALLAS', '2020-12-21'),
 (30, 'MARTIN', 1250, 'SALES', 'CHICAGO', '2020-12-21'),
 (30, 'BLAKE', 2850, 'SALES', 'CHICAGO', '2020-12-21'),
 (10, 'CLARK', 2450, 'ACCOUNTING', 'NEW YORK', '2020-12-21'),
 (20, 'SCOTT', 3000, 'RESEARCH', 'DALLAS', '2020-12-21'),
 (10, 'KING', 5000, 'ACCOUNTING', 'NEW YORK', '2020-12-21'),
 (30, 'TURNER', 1500, 'SALES', 'CHICAGO', '2020-12-21'),
 (20, 'ADAMS', 1100, 'RESEARCH', 'DALLAS', '2020-12-21'),
 (30, 'JAMES', 950, 'SALES', 'CHICAGO', '2020-12-21'),
 (20, 'FORD', 3000, 'RESEARCH', 'DALLAS', '2020-12-21'),
 (10, 'MILLER', 1300, 'ACCOUNTING', 'NEW YORK', '2020-12-21')]

## 14.11 Parsing Serialized Data into Rows

In [12]:
%%sql
with strings as (
    select unnest(array [
        'entry:stewiegriffin:lois:brian:',
        'entry:moe::sizlack:',
        'entry:petergriffin:meg:chris:',
        'entry:willie:',
        'entry:quagmire:mayorwest:cleveland:',
        'entry:::flanders:',
        'entry:robo:tchi:ken:']) as text),
     matches as (
         select regexp_matches(text, 'entry:(.*):(.*):(.*):') as match
         from strings
     )
select match[1] as val1, match[2] as val2, match[3] as val3
from matches;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
6 rows affected.

[('stewiegriffin', 'lois', 'brian'),
 ('moe', '', 'sizlack'),
 ('petergriffin', 'meg', 'chris'),
 ('quagmire', 'mayorwest', 'cleveland'),
 ('', '', 'flanders'),
 ('robo', 'tchi', 'ken')]

## 14.12 Calculating Percent Relative to Total

In [13]:
%%sql
select distinct job,
                count(*) over (partition by job)                                  as num_emps,
                floor(100. * sum(sal) over (partition by job) / sum(sal) over ()) as pct_of_all_salaries
from emp
order by job;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
5 rows affected.

[('ANALYST', 2, Decimal('20')),
 ('CLERK', 4, Decimal('14')),
 ('MANAGER', 3, Decimal('28')),
 ('PRESIDENT', 1, Decimal('17')),
 ('SALESMAN', 4, Decimal('19'))]

## 14.13 Testing for Existence of a Value Within a Group

In [14]:
%%sql
with v as (
    select *
    from (values (1, 1, 2, 1, '01-FEB-2020'::date, 0),
                 (1, 2, 2, 1, '01-MAR-2020'::date, 1),
                 (1, 3, 2, 1, '01-APR-2020'::date, 0),
                 (1, 4, 2, 2, '01-MAY-2020'::date, 0),
                 (1, 5, 2, 2, '01-JUN-2020'::date, 0),
                 (1, 6, 2, 2, '01-JUL-2020'::date, 0)
         ) as t(student_id, test_id, grade_id, period_id, test_date, pass_fail)
)
select student_id,
       test_id,
       grade_id,
       period_id,
       test_date,
       case max(pass_fail) over (partition by student_id,grade_id,period_id)
           when 1 then '+'
           else '-' end as metreq,
       (
           0 = max(pass_fail) over (partition by student_id,grade_id,period_id) and
           test_date = max(test_date) over (partition by student_id,grade_id,period_id)
       )::int           as in_progress
from v;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
6 rows affected.

[(1, 1, 2, 1, datetime.date(2020, 2, 1), '+', 0),
 (1, 2, 2, 1, datetime.date(2020, 3, 1), '+', 0),
 (1, 3, 2, 1, datetime.date(2020, 4, 1), '+', 0),
 (1, 4, 2, 2, datetime.date(2020, 5, 1), '-', 0),
 (1, 5, 2, 2, datetime.date(2020, 6, 1), '-', 0),
 (1, 6, 2, 2, datetime.date(2020, 7, 1), '-', 1)]